# FilterInverseRule Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterInverseRule Class
Members See Also
---
A filter rule that inverts the boolean values returned by the rule it contains.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilterInverseRule : FilterRule
```

Visual Basic
---
```text
Public Class FilterInverseRule _
	Inherits FilterRule
```

Visual C++
---
```text
public ref class FilterInverseRule : public FilterRule
```

# Remarks
FilterInverse rule performs a logical "not" operation on its inner rule's "elementPasses()" method.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterRule Autodesk.Revit.DB..::..FilterInverseRule
# See Also
FilterInverseRule Members
Autodesk.Revit.DB Namespace